[
  {
    "id": "ebook-edct",
    "title": "Electronic Devices and Circuit Theory",
    "author": "Boylestad & Nashelsky",
    "category": "Electronics & Communication",
    "cover": "⚡",
    "isEbook": true,
    "ratings": [],
    "pages": [
      "⚡  ELECTRONIC DEVICES AND CIRCUIT THEORY\n════════════════════════════════════════════════════════════\nAuthor   : Boylestad & Nashelsky\nCategory : Electronics & Communication\nSource   : Wikipedia (CC BY-SA 4.0)\nTopics   : Semiconductor device, P–n junction, Diode, Bipolar junction transistor, MOSFET, Field-effect transistor, Operational amplifier, Electronic amplifier, Electronic oscillator, Voltage regulator, Rectifier\n\nThis e-book contains real encyclopedic content on the core\ntopics of \"Electronic Devices and Circuit Theory\", compiled from Wikipedia.\nNavigate using the arrows below to read each chapter.",
      "============================================================\nSemiconductor device\n============================================================\n\nA semiconductor device is an electronic component that relies on the electronic properties of a semiconductor material (primarily silicon, germanium, and gallium arsenide, as well as organic semiconductors) for its function. Its conductivity lies between conductors and insulators. Semiconductor devices have replaced vacuum tubes in most applications. They conduct electric current in the solid state, rather than as free electrons across a vacuum (typically liberated by thermionic emission) or as free electrons and ions through an ionized gas.\nSemiconductor devices are manufactured both as single discrete devices and as integrated circuits, which consist of two or more devices—which can number from the hundreds to the billions—manufactured and interconnected on a single semiconductor wafer (also called a substrate).\nSemiconductor materials are useful because their behavior can be easily manipulated by the deliberate addition of impurities, known as doping. Semiconductor conductivity can be controlled by the introduction of an electric or magnetic field, by exposure to light or heat, or by the mechanical deformation of a doped monocrystalline silicon grid; thus, semiconductors can make excellent sensors. Current conduction in a semiconductor occurs due to mobile or \"free\" electrons and electron holes, collectively known as charge carriers. Doping a semiconductor with a small proportion of an atomic impurity, such as phosphorus or boron, greatly increases the number of free electrons or holes within the semiconductor. When a doped semiconductor contains excess holes, it is called a p-type semiconductor (p for positive electric charge); when it contains excess free electrons, it is called an n-type semiconductor (n for a negative electric charge). A majority of mobile charge carriers have negative charges. The manufacture of semiconductors controls precisely the location and concentration of p- and n-type dopants. The connection of n-type and p-type semiconductors form p–n junctions.\nThe most common semiconductor device in the world is the MOSFET (metal–oxide–semiconductor field-effect transistor), also called the MOS transistor. As of 2013, billions of MOS transistors are manufactured every day. Semiconductor devices made per year have been growing by 9.1% on average since 1978, and shipments in 2018 are predicted for the first time to exceed 1 trillion, meaning that well over 7  trillion have been made to date.\n\n\n\n============================================================\nP–n junction\n============================================================\n\nA p–n junction is a combination of two types of semiconductor materials, p-type and n-type, in a single crystal. The \"n\" (negative) side contains freely-moving electrons, while the \"p\" (positive) side contains freely-moving electron holes. Connecting the two materi",
      "als causes creation of a depletion region near the boundary, as the free electrons fill the available holes, which in turn allows electric current to pass through the junction only in one direction.\np–n junctions represent the simplest case of a semiconductor electronic device; a p–n junction by itself, when connected on both sides to a circuit, is a diode. More complex circuit components can be created by further combinations of p-type and n-type semiconductors; for example, the bipolar junction transistor (BJT) is a semiconductor in the form n–p–n or p–n–p. Combinations of such semiconductor devices on a single chip allow for the creation of integrated circuits.\nSolar cells and light-emitting diodes (LEDs) are essentially p–n junctions where the semiconductor materials are chosen, and the component's geometry designed, to maximise the desired effect (light absorption or emission). A Schottky junction is a similar case to a p–n junction, where instead of an n-type semiconductor, a metal directly serves the role of the \"negative\" charge provider.\nThe invention of the p–n junction is usually attributed to American physicist Russell Ohl of Bell Laboratories in 1939. Two years later (1941), Vadim Lashkaryov reported discovery of p–n junctions in Cu2O and silver sulphide photocells and selenium rectifiers. The modern theory of p–n junctions was elucidated by William Shockley in his classic work Electrons and Holes in Semiconductors (1950).\n\n============================================================\nDiode\n============================================================\n\nA diode is a two-terminal electronic component that conducts electric current primarily in one direction (asymmetric conductance). It has low (ideally zero) resistance in one direction and high (ideally infinite) resistance in the other.\nA semiconductor diode, the most commonly used type today, is a crystalline piece of semiconductor material with a p–n junction connected to two electrical terminals. It has an exponential current–voltage characteristic. Semiconductor diodes were the first semiconductor electronic devices. The discovery of asymmetric electrical conduction across the contact between a crystalline mineral and a metal was made by German physicist Ferdinand Braun in 1874. Today, most diodes are made of silicon, but other semiconducting materials such as gallium arsenide and germanium are also used.\nThe obsolete thermionic diode is a vacuum tube with two electrodes, a heated cathode and a plate, in which electrons can flow in only one direction, from the cathode to the plate.\nAmong many uses, diodes are found in rectifiers to convert alternating current (AC) power to direct current (DC), demodulation in radio receivers, and can even be used for logic or as temperature sensors. A common variant of a diode is a light-emitting diode, which is used as electric lighting and status indicators on electronic devices.\n\n\n\n============================================================\nBipo",
      "lar junction transistor\n============================================================\n\nA bipolar junction transistor (BJT) is a type of transistor that uses both electrons and electron holes as charge carriers. In contrast, a unipolar transistor, such as a field-effect transistor (FET), uses only one kind of charge carrier. A bipolar transistor allows a small current injected at one of its terminals to control a much larger current between the remaining two terminals, making the device capable of amplification or switching.\nBJTs use two p–n junctions between two semiconductor types, n-type and p-type, which are regions in a single crystal of material. The junctions can be made in several different ways, such as changing the doping of the semiconductor material as it is grown, by depositing metal pellets to form alloy junctions, or by such methods as diffusion of n-type and p-type doping substances into the crystal. The superior predictability and performance of junction transistors quickly displaced the original point-contact transistor. Diffused transistors, along with other components, are elements of integrated circuits for analog and digital functions.  Hundreds of bipolar junction transistors can be made in one circuit at a very low cost.\nBipolar transistor integrated circuits were the main active devices of a generation of mainframe and minicomputers, but computer systems now use complementary metal–oxide–semiconductor (CMOS) integrated circuits relying on the field-effect transistor (FET). Bipolar transistors are still used for amplification of signals, switching, and in mixed-signal integrated circuits using BiCMOS. Specialized types are used for high voltage and high current switches, or for radio-frequency (RF) amplifiers.\n\n============================================================\nMOSFET\n============================================================\n\nIn electronics, the metal–oxide–semiconductor field-effect transistor (MOSFET, MOS-FET, MOS FET, or MOS transistor) is a type of field-effect transistor (FET), most commonly fabricated by the controlled oxidation of silicon. It has an insulated gate, the voltage of which determines the conductivity of the device. This ability to change conductivity with the amount of applied voltage can be used for amplifying or switching electronic signals. The term metal–insulator–semiconductor field-effect transistor (MISFET) is almost synonymous with MOSFET. Another near-synonym is insulated-gate field-effect transistor (IGFET).\nThe main advantage of a MOSFET is that it requires almost no input current to control the load current under steady-state or low-frequency conditions, especially compared to bipolar junction transistors (BJTs). However, at high frequencies or when switching rapidly, a MOSFET may require significant current to charge and discharge its gate capacitance. In an enhancement mode MOSFET, voltage applied to the gate terminal increases the conductivity of the device. In depletion mode t",
      "ransistors, voltage applied at the gate reduces the conductivity.\nThe \"metal\" in the name MOSFET is sometimes a misnomer, because the gate material can be a layer of polysilicon (polycrystalline silicon). Similarly, \"oxide\" in the name can also be a misnomer, as different dielectric materials are used with the aim of obtaining strong channels with smaller applied voltages.\nThe MOSFET is by far the most common transistor in digital circuits, as billions may be included in a memory chip or microprocessor. As MOSFETs can be made with either a p-type or n-type channel, complementary pairs of MOS transistors can be used to make switching circuits with very low power consumption, in the form of CMOS logic.\n\n\n\n============================================================\nField-effect transistor\n============================================================\n\nThe field-effect transistor (FET) is a type of transistor that uses an electric field to control the current through a semiconductor. It comes in two types: junction FET (JFET) and metal–oxide–semiconductor FET (MOSFET). FETs have three terminals: source, gate, and drain. FETs control the current by the application of a voltage to the gate, which in turn alters the conductivity between the drain and source.\nFETs are also known as unipolar transistors since they involve single-carrier-type operation. That is, FETs use either electrons (n-channel) or holes (p-channel) as charge carriers in their operation, but not both. Many different types of field-effect transistors exist. Field effect transistors generally display very high input impedance at low frequencies. The most widely used field-effect transistor is the MOSFET.\n\n\n\n============================================================\nOperational amplifier\n============================================================\n\nAn operational amplifier (often op amp, op-amp, or opamp) is a DC-coupled electronic amplifier with a differential input, a (usually) single-ended output voltage, and an extremely high gain. Its name comes from its original use of performing mathematical operations in analog computers. The voltage-feedback opamp (VFOA or VFA, the focus of this article) amplifies the voltage difference between its two inputs, while the less common current-feedback op amp (CFOA) amplifies the current between its two inputs.\nBy using negative feedback, the characteristics of an op amp application circuit (e.g., its gain, input and output impedance, bandwidth, and functionality) can be determined by external components and have little dependence on temperature coefficients or engineering tolerance in the op amp itself. This flexibility has made the op amp a popular building block in analog circuits.\nToday, op amps are used widely in consumer, industrial, and scientific electronics. Many standard integrated circuit op amps cost only a few cents; however, some integrated or hybrid operational amplifiers with special performance specifications may cost over US$100. O",
      "p amps may be packaged as components or used as elements of more complex integrated circuits.\nThe op amp is one type of differential amplifier. Other differential amplifier types include the fully differential amplifier (an op amp with a differential rather than single-ended output), the instrumentation amplifier (usually built from three op amps), the isolation amplifier (with galvanic isolation between input and output), and negative-feedback amplifier (usually built from one or more op amps and a resistive feedback network).\n\n\n\n============================================================\nElectronic amplifier\n============================================================\n\nAn amplifier, electronic amplifier or (informally) amp is an electronic device that can increase the magnitude of a signal (a time-varying voltage or current).  It is a two-port electronic circuit that uses electric power from a power supply to increase the amplitude (magnitude of the voltage or current) of a signal applied to its input terminals, producing a proportionally greater amplitude signal at its output. The amount of amplification provided by an amplifier is measured by its gain: the ratio of output voltage, current, or power to input. An amplifier is defined as a circuit that has a power gain greater than one.\nAn amplifier can be either a separate piece of equipment or an electrical circuit contained within another device. Amplification is fundamental to modern electronics, and amplifiers are widely used in almost all electronic equipment. Amplifiers can be categorized in different ways. One is by the frequency of the electronic signal being amplified. For example, audio amplifiers amplify signals of less than 20 kHz, radio frequency (RF) amplifiers amplify frequencies in the range between 20 kHz and 300 GHz, and servo amplifiers and instrumentation amplifiers may work with very low frequencies down to direct current. Amplifiers can also be categorized by their physical placement in the signal chain; a preamplifier may precede other signal processing stages, for example, while a power amplifier is usually used after other amplifier stages to provide enough output power for the final use of the signal. The first practical electrical device which could amplify was the triode vacuum tube, invented in 1906 by Lee de Forest, which led to the first amplifiers around 1912. Today most amplifiers use transistors.\n\n============================================================\nElectronic oscillator\n============================================================\n\nAn electronic oscillator is an electronic circuit that produces a periodic, oscillating or alternating current (AC) signal, usually a sine wave, square wave or a triangle wave, powered by a direct current (DC) source. Oscillators are found in many electronic devices, such as radio receivers, television sets, radio and television broadcast transmitters, computers, computer peripherals, cellphones, radar, and many other device",
      "s.\nOscillators are often characterized by the frequency of their output signal:\n\nA low-frequency oscillator (LFO) is an oscillator that generates a frequency below approximately 20 Hz. This term is typically used in the field of audio synthesizers, to distinguish it from an audio frequency oscillator.\nAn audio oscillator produces frequencies in the audio range, 20 Hz to 20 kHz.\nA radio frequency (RF) oscillator produces signals above the audio range, more generally in the range of 100 kHz to 100 GHz.\n\nThere are two general types of electronic oscillators: the linear or harmonic oscillator, and the nonlinear or relaxation oscillator.  The two types are fundamentally different in how oscillation is produced, as well as in the characteristic type of output signal that is generated.\nThe most-common linear oscillator in use is the crystal oscillator, in which the output frequency is controlled by a piezo-electric resonator consisting of a vibrating quartz crystal.  Crystal oscillators are ubiquitous in modern electronics, being the source for the clock signal in computers and digital watches, as well as a source for the signals generated in radio transmitters and receivers.  As a crystal oscillator's “native” output waveform is sinusoidal, a signal-conditioning circuit may be used to convert the output to other waveform types, such as the square wave typically utilized in computer clock circuits.\n\n\n\n============================================================\nVoltage regulator\n============================================================\n\nA voltage regulator is a system designed to automatically maintain a constant voltage. It may use a simple feed-forward design or may include negative feedback. It may use an electromechanical mechanism or electronic components. Depending on the design, it may be used to regulate one or more AC or DC voltages.\nElectronic voltage regulators are found in devices such as computer power supplies where they stabilize the DC voltages used by the processor and other elements. In automobile alternators and central power station generator plants, voltage regulators control the output of the plant. In an electric power distribution system, voltage regulators may be installed at a substation or along distribution lines so that all customers receive steady voltage independent of how much power is drawn from the line.\n\n============================================================\nRectifier\n============================================================\n\nA rectifier is an electrical device that converts alternating current (AC), which periodically reverses direction, to direct current (DC), which flows in only one direction.\nThe process is known as rectification, since it \"straightens\" the direction of current. Physically, rectifiers take a number of forms, including vacuum tube diodes, wet chemical cells, mercury-arc valves, stacks of copper and selenium oxide plates, semiconductor diodes, silicon-controlled rectifiers and other silic",
      "on-based semiconductor switches. Historically, even synchronous electromechanical switches and motor–generator sets have been used. Early radio receivers, called crystal radios, used a \"cat's whisker\" of fine wire pressing on a crystal of galena (lead sulfide) to serve as a point-contact rectifier or \"crystal detector\".\nRectifiers have many uses, but are often found serving as components of DC power supplies and high-voltage direct current power transmission systems. Rectification may serve in roles other than to generate direct current for use as a source of power. As noted, rectifiers can serve as detectors of radio signals. In gas heating systems flame rectification is used to detect the presence of a flame.\nDepending on the type of alternating current supply and the arrangement of the rectifier circuit, the output voltage may require additional smoothing to produce a uniform steady voltage. Many applications of rectifiers, such as power supplies for radio, television and computer equipment, require a steady constant DC voltage (as would be produced by a battery).  In these applications the output of the rectifier is smoothed by an electronic filter, which may be a capacitor, choke, or set of capacitors, chokes and resistors, possibly followed by a voltage regulator to produce a steady voltage.\nA device that performs the opposite function, that is converting DC to AC, is called an inverter."
    ]
  },
  {
    "id": "ebook-bee",
    "title": "Basics of Electrical Engineering",
    "author": "V.K. Mehta & Rohit Mehta",
    "category": "Electrical Engineering",
    "cover": "🔌",
    "isEbook": true,
    "ratings": [],
    "pages": [
      "🔌  BASICS OF ELECTRICAL ENGINEERING\n════════════════════════════════════════════════════════════\nAuthor   : V.K. Mehta & Rohit Mehta\nCategory : Electrical Engineering\nSource   : Wikipedia (CC BY-SA 4.0)\nTopics   : Ohm's law, Electric current, Electric potential, Electrical resistance and conductance, Kirchhoff's circuit laws, Electrical network, Alternating current, Electric power, Transformer, Electric motor, Electrical measuring instrument\n\nThis e-book contains real encyclopedic content on the core\ntopics of \"Basics of Electrical Engineering\", compiled from Wikipedia.\nNavigate using the arrows below to read each chapter.",
      "============================================================\nOhm's law\n============================================================\n\nOhm's law states that the electric current through a conductor between two points is directly proportional to the voltage across the two points. Introducing the constant of proportionality, the resistance, one arrives at the three mathematical equations used to describe this relationship:\n\n  \n    \n      \n        V\n        =\n        I\n        R\n        \n        \n          or\n        \n        \n        I\n        =\n        \n          \n            V\n            R\n          \n        \n        \n        \n          or\n        \n        \n        R\n        =\n        \n          \n            V\n            I\n          \n        \n      \n    \n    {\\displaystyle V=IR\\quad {\\text{or}}\\quad I={\\frac {V}{R}}\\quad {\\text{or}}\\quad R={\\frac {V}{I}}}\n  \n\nwhere I is the current through the conductor, V is the voltage measured across the conductor and R is the resistance of the conductor. More specifically, Ohm's law states that the R in this relation is constant, independent of the current. If the resistance is not constant, the previous equation cannot be called Ohm's law, but it can still be used as a definition of static/DC resistance. Ohm's law is an empirical relation which accurately describes the conductivity of the vast majority of electrically conductive materials over many orders of magnitude of current. However some materials do not obey Ohm's law; these are called non-ohmic.\nThe law was named after the German physicist Georg Ohm, who, in a treatise published in 1827, described measurements of applied voltage and current through simple electrical circuits containing various lengths of wire. Ohm explained his experimental results by a slightly more complex equation than the modern form above (see § History below).\nIn physics, the term Ohm's law is also used to refer to various generalizations of the law; for example the vector form of the law used in electromagnetics and material science:\n\n  \n    \n      \n        \n          J\n        \n        =\n        σ\n        \n          E\n        \n        ,\n      \n    \n    {\\displaystyle \\mathbf {J} =\\sigma \\mathbf {E} ,}\n  \n\nwhere J is the current density at a given location in a resistive material, E is the electric field at that location, and σ (sigma) is a material-dependent parameter called the conductivity, defined as the inverse of resistivity ρ (rho). This reformulation of Ohm's law is due to Gustav Kirchhoff.\n\n\n\n============================================================\nElectric current\n============================================================\n\nAn electric current is a flow of charged particles, such as electrons or ions, moving through an electrical conductor or space. It is defined as the net rate of flow of electric charge through a surface. The moving particles are called charge carriers, which may be one of several types of particles, depending on the conductor.  In electric cir",
      "cuits the charge carriers are often electrons moving through a wire. In semiconductors they can be electrons or holes. In an electrolyte the charge carriers are ions, while in plasma, an ionized gas, they are ions and electrons.\nIn the International System of Units (SI), electric current is expressed in units of ampere (sometimes called an \"amp\", symbol A), which is equivalent to one coulomb per second. The ampere is an SI base unit and electric current is a base quantity in the International System of Quantities (ISQ). Electric current is also known as amperage and is measured using a device called an ammeter.\nElectric currents create magnetic fields, which are used in motors, generators, inductors, and transformers. In ordinary conductors, they cause Joule heating, which creates light in incandescent light bulbs. Time-varying currents emit electromagnetic waves, which are used in telecommunications to broadcast information.\n\n\n\n============================================================\nElectric potential\n============================================================\n\nElectric potential, also known as the electric field potential, potential drop, the electrostatic potential, is the difference in electric potential energy per unit of electric charge between two points in a static electric field. More precisely, electric potential is the amount of work needed to move a test charge from a reference point to a specific point in a static electric field, normalized to a unit of charge. The test charge used is small enough that disturbance to the field-producing charges is unnoticeable, and its motion across the field is supposed to proceed with negligible acceleration, so as to avoid the test charge acquiring kinetic energy or producing radiation. By definition, the electric potential at the reference point is zero units. Typically, the reference point is earth or a point at infinity, although any point can be used.\nIn classical electrostatics, the electrostatic field is a vector quantity expressed as the gradient of the electrostatic potential, which is a scalar quantity denoted by V or occasionally φ, equal to the electric potential energy of any charged particle at any location (measured in joules) divided by the charge of that particle (measured in coulombs). By dividing out the charge on the particle a quotient is obtained that is a property of the electric field itself. In short, an electric potential is the electric potential energy per unit charge.\nThis value can be calculated in either a static (time-invariant) or a dynamic (time-varying) electric field at a specific time with the unit joules per coulomb (J⋅C−1) or volt (V). The electric potential at infinity is assumed to be zero.\nIn electrodynamics, when time-varying fields are present, the electric field cannot be expressed only as a scalar potential. Instead, the electric field can be expressed as both the scalar electric potential and the magnetic vector potential. The electric potential",
      "and the magnetic vector potential together form a four-vector, so that the two kinds of potential are mixed under Lorentz transformations.\nPractically, the electric potential is a continuous function in all space, because a spatial derivative of a discontinuous electric potential yields an electric field of impossibly infinite magnitude. Notably, the electric potential due to an idealized point charge (proportional to 1 ⁄ r, with r the distance from the point charge) is continuous in all space except at the location of the point charge. Though electric field is not continuous across an idealized surface charge, it is not infinite at any point. Therefore, the electric potential is continuous across an idealized surface charge. Additionally, an idealized line of charge has electric potential (proportional to ln(r), with r the radial distance from the line of charge) is continuous everywhere except on the line of charge.\n\n============================================================\nElectrical resistance and conductance\n============================================================\n\nThe electrical resistance of an object is a measure of its opposition to the flow of electric current. Its reciprocal quantity is electrical conductance, measuring the ease with which an electric current passes. Electrical resistance shares some conceptual parallels with mechanical friction. The SI unit of electrical resistance is the ohm (Ω), while electrical conductance is measured in siemens (S) (formerly called the 'mho' and then represented by ℧).\nThe resistance of an object depends in large part on the material it is made of. Objects made of electrical insulators like rubber tend to have very high resistance and low conductance, while objects made of electrical conductors like metals tend to have very low resistance and high conductance. This relationship is quantified by resistivity or conductivity. The nature of a material is not the only factor in resistance and conductance, however; it also depends on the size and shape of an object because these properties are extensive rather than intensive. For example, a wire's resistance is higher if it is long and thin, and lower if it is short and thick. All objects resist electrical current, except for superconductors, which have a resistance of zero.\nThe resistance R of an object is defined as the ratio of voltage V across it to current I through it, while the conductance G is the reciprocal:\n\n  \n    \n      \n        R\n        =\n        \n          \n            V\n            I\n          \n        \n        ,\n        \n        G\n        =\n        \n          \n            I\n            V\n          \n        \n        =\n        \n          \n            1\n            R\n          \n        \n        .\n      \n    \n    {\\displaystyle R={\\frac {V}{I}},\\qquad G={\\frac {I}{V}}={\\frac {1}{R}}.}\n  \n\nFor a wide variety of materials and conditions, V and I  are directly proportional to each other, and therefore R and G are constants (although the",
      "y will depend on the size and shape of the object, the material it is made of, and other factors like temperature or strain). This proportionality is called Ohm's law, and materials that satisfy it are called ohmic materials.\nIn other cases, such as a transformer, diode, incandescent light bulb or battery, V and I are not directly proportional. The ratio ⁠V/I⁠ is sometimes still useful, and is referred to as a chordal resistance or static resistance, since it corresponds to the inverse slope of a chord between the origin and an I–V curve. In other situations, the derivative \n  \n    \n      \n        \n          \n            \n              \n                d\n              \n              V\n            \n            \n              \n                d\n              \n              I\n            \n          \n        \n      \n    \n    {\\textstyle {\\frac {\\mathrm {d} V}{\\mathrm {d} I}}}\n  \n may be most useful; this is called the differential resistance.\n\n\n\n============================================================\nKirchhoff's circuit laws\n============================================================\n\nKirchhoff's circuit laws are two equalities that deal with the current and potential difference (commonly known as voltage) in the lumped element model of electrical circuits. They were first described in 1845 by German physicist Gustav Kirchhoff. This generalized the work of Georg Ohm and preceded the work of James Clerk Maxwell. Widely used in electrical engineering, they are also called Kirchhoff's rules or simply Kirchhoff's laws. These laws can be applied in time and frequency domains and form the basis for network analysis.\nBoth of Kirchhoff's laws can be understood as corollaries of Maxwell's equations in the low-frequency limit. They are accurate for DC circuits, and for AC circuits at frequencies where the wavelengths of electromagnetic radiation are very large compared to the circuits.\n\n============================================================\nElectrical network\n============================================================\n\nAn electrical network is an interconnection of electrical components (e.g., batteries, resistors, inductors, capacitors, switches, transistors) or a model of such an interconnection, consisting of electrical elements (e.g., voltage sources, current sources, resistances, inductances, capacitances). An electrical circuit is a network consisting of a closed loop, giving a return path for the current. Thus all circuits are networks, but not all networks are circuits (although networks without a closed loop are often referred to as open circuits).\nA resistive network is a network containing only resistors and ideal current and voltage sources. Analysis of resistive networks is less complicated than analysis of networks containing capacitors and inductors. If the sources are constant (DC) sources, the result is a DC network. The effective resistance and current distribution properties of arbitrary resistor networks can be modeled in terms",
      "of their graph measures and geometrical properties.\nA network that contains active electronic components is known as an electronic circuit. Such networks are generally nonlinear and require more complex design and analysis tools.\n\n============================================================\nAlternating current\n============================================================\n\nAlternating current (AC) is an electric current that periodically reverses direction and changes its magnitude continuously with time, in contrast to direct current (DC), which flows only in one direction. Alternating current is the form in which electric power is delivered to businesses and residences, and it is the form of electrical energy that consumers typically use when they plug kitchen appliances, televisions, fans and electric lamps into a wall socket. The abbreviations AC and DC are often used to mean simply alternating and direct, respectively, as when they modify current or voltage.\nThe usual waveform of alternating current in most electric power circuits is a sine wave, whose positive half-period corresponds with positive direction of the current and vice versa (the full period is called a cycle). \"Alternating current\" most commonly refers to power distribution, but a wide range of other applications are technically alternating current although it is less common to describe them by that term.   In many applications, like guitar amplifiers, different waveforms are used, such as triangular waves or square waves. Audio and radio signals carried on electrical wires are also examples of alternating current. These types of alternating current carry information such as sound (audio) or images (video) sometimes carried by modulation of an AC carrier signal. These currents typically alternate at higher frequencies than those used in power transmission.\n\n============================================================\nElectric power\n============================================================\n\nElectric power is the rate of transfer of electrical energy within a circuit. Its SI unit is the watt, the general unit of power, defined as one joule per second. Standard prefixes apply to watts as with other SI units: thousands, millions and billions of watts are called kilowatts, megawatts and gigawatts respectively.\nIn common parlance, electric power is the production and delivery of electrical energy, an essential public utility in much of the world. Electric power is usually produced by electric generators, but can also be supplied by sources such as electric batteries. It is usually supplied to businesses and homes (as domestic mains electricity) by the electric power industry through an electrical grid.\nElectric power can be delivered over long distances by transmission lines and used for applications such as motion, light or heat with high efficiency.\n\n============================================================\nTransformer\n==========================================================",
      "==\n\nIn electrical engineering, a transformer is a passive component that transfers electrical energy from one electrical circuit to another circuit, or multiple circuits. A varying current in any coil of the transformer produces a varying magnetic flux in the transformer's core, which induces a varying electromotive force (EMF) across any other coils wound around the same core. Electrical energy can be transferred between separate coils without a metallic (conductive) connection between the two circuits. Faraday's law of induction, discovered in 1831, describes the induced voltage effect in any coil due to a changing magnetic flux encircled by the coil.\nTransformers are used to change AC voltage levels, such transformers being termed step-up or step-down type to increase or decrease voltage level, respectively. Transformers can also be used to provide galvanic isolation between circuits as well as to couple stages of signal-processing circuits. Since the invention of the first constant-potential transformer in 1885, transformers have become essential for the transmission, distribution, and utilization of alternating current electric power. A wide range of transformer designs is encountered in electronic and electric power applications. Transformers range in size from RF transformers less than a cubic centimeter in volume, to units weighing hundreds of tons used to interconnect the power grid.\n\n\n\n============================================================\nElectric motor\n============================================================\n\nAn electric motor is a machine that converts electrical energy into mechanical energy. Most electric motors operate through the interaction between the motor's magnetic field and electric current in a wire winding to generate Laplace force in the form of torque applied on the motor's shaft. An electric generator is mechanically identical to an electric motor but operates inversely, converting mechanical energy into electrical energy.\nElectric motors can be powered by direct current (DC) sources, such as from batteries or rectifiers, or by alternating current (AC) sources, such as a power grid, inverters or electrical generators. Electric motors may also be classified by considerations such as power source type, construction, application and type of motion output. They can be brushed or brushless, single-phase, two-phase, or three-phase, axial or radial flux, and may be air-cooled or liquid-cooled.\nStandardized electric motors provide power for industrial use. The largest are used for marine propulsion, pipeline compression and pumped-storage applications, with output exceeding 100 megawatts. Other applications include industrial fans, blowers and pumps, machine tools, household appliances, power tools, vehicles, and disk drives. Small motors may be found in electric watches. In certain applications, such as in regenerative braking with traction motors, electric motors can be used in reverse as generators to recover ener",
      "gy that might otherwise be lost as heat and friction.\nElectric motors produce linear or rotary force (torque) intended to propel some external mechanism. This makes them a type of actuator. They are generally designed for continuous rotation, or for linear movement over a significant distance compared to its size. Solenoids also convert electrical power to mechanical motion, but over only a limited distance."
    ]
  },
  {
    "id": "ebook-bee10c",
    "title": "Basic of Electric Engineering (10 C)",
    "author": "Educational Board Press",
    "category": "Electrical Engineering",
    "cover": "🔋",
    "isEbook": true,
    "ratings": [],
    "pages": [
      "🔋  BASIC OF ELECTRIC ENGINEERING (10 C)\n════════════════════════════════════════════════════════════\nAuthor   : Educational Board Press\nCategory : Electrical Engineering\nSource   : Wikipedia (CC BY-SA 4.0)\nTopics   : Electricity, Electric charge, Electric current, Voltage, Electrical resistance and conductance, Series and parallel circuits, Electromagnetism, Electromagnetic induction, Electric battery, Electrical safety, Electric power\n\nThis e-book contains real encyclopedic content on the core\ntopics of \"Basic of Electric Engineering (10 C)\", compiled from Wikipedia.\nNavigate using the arrows below to read each chapter.",
      "============================================================\nElectricity\n============================================================\n\nElectricity is the set of physical phenomena associated with the presence and motion of matter possessing an electric charge. Electricity is related to magnetism, both being part of the phenomenon of electromagnetism, as described by Maxwell's equations. Common phenomena are related to electricity, including lightning, static electricity, electric heating, electric discharges and many others.\nThe presence of either a positive or negative electric charge produces an electric field. The motion of electric charge carriers is an electric current and produces a magnetic field. In most applications, Coulomb's law determines the force acting on an electrically charged particle. Electric potential is the work done to move an electric charge from one position to another within an electric field, typically measured in volts.\nElectricity plays a central role in many modern technologies, serving in electric power where electric current is used to energise equipment, and in electronics dealing with electrical circuits involving active components such as vacuum tubes, transistors, diodes and integrated circuits, and associated passive interconnection technologies.\nThe study of electrical phenomena dates back to antiquity, with theoretical understanding progressing slowly until the 17th and 18th centuries. The development of the theory of electromagnetism in the 19th century marked significant progress, leading to electricity's industrial and residential application by electrical engineers by the century's end. This rapid expansion in electrical technology at the time was the driving force behind the Second Industrial Revolution, with electricity's versatility driving transformations in both industry and society. Electricity is integral to applications spanning transport, heating/cooling, lighting, communications, and computation, making it the foundation of modern industrial society.\n\n============================================================\nElectric charge\n============================================================\n\nElectric charge (symbol q, sometimes Q) is a physical property of matter that causes it to experience a force when placed in an electromagnetic field. Electric charge can be positive or negative. Like charges repel each other and unlike charges attract each other. An object with no net charge is referred to as electrically neutral. Early knowledge of how charged substances interact is now called classical electrodynamics, and is still accurate for problems that do not require consideration of quantum effects.\nIn an isolated system, the total charge stays the same - the amount of positive charge minus the amount of negative charge does not change over time. Electric charge carriers include subatomic particles. In ordinary matter, negative charge is carried by electrons, and positive charge is carried by the prot",
      "ons in the nuclei of atoms. If there are more electrons than protons in a piece of matter, it will have a negative charge, if there are fewer it will have a positive charge, and if there are equal numbers it will be neutral. \nCharge is quantized: it comes in integer multiples of individual small units called the elementary charge, e, about 1.602×10−19 C, which is the smallest charge that can exist freely.  Particles called quarks have smaller charges, multiples of ⁠1/3⁠e, but they are found only combined in particles that have a charge that is an integer multiple of e. In the Standard Model, charge is an absolutely conserved quantum number. The proton has a charge of +e, and the electron has a charge of −e. Today, a negative charge is defined as the charge carried by an electron and a positive charge is that carried by a proton. Before these particles were discovered, a positive charge was defined by Benjamin Franklin as the charge acquired by a glass rod when it is rubbed with a silk cloth.\nElectric charges produce electric fields. A moving charge also produces a magnetic field. The interaction of electric charges with an electromagnetic field (a combination of an electric and a magnetic field) is the source of the electromagnetic (or Lorentz) force, which is one of the four fundamental interactions in physics. The study of photon-mediated interactions among charged particles is called quantum electrodynamics.\nThe SI derived unit of electric charge is the coulomb (C) named after French physicist Charles-Augustin de Coulomb. In electrical engineering it is also common to use the ampere-hour (A⋅h). In physics and chemistry it is common to use the elementary charge (e) as a unit. Chemistry also uses the Faraday constant, which is the charge of one mole of elementary charges.\n\n============================================================\nElectric current\n============================================================\n\nAn electric current is a flow of charged particles, such as electrons or ions, moving through an electrical conductor or space. It is defined as the net rate of flow of electric charge through a surface. The moving particles are called charge carriers, which may be one of several types of particles, depending on the conductor.  In electric circuits the charge carriers are often electrons moving through a wire. In semiconductors they can be electrons or holes. In an electrolyte the charge carriers are ions, while in plasma, an ionized gas, they are ions and electrons.\nIn the International System of Units (SI), electric current is expressed in units of ampere (sometimes called an \"amp\", symbol A), which is equivalent to one coulomb per second. The ampere is an SI base unit and electric current is a base quantity in the International System of Quantities (ISQ). Electric current is also known as amperage and is measured using a device called an ammeter.\nElectric currents create magnetic fields, which are used in motors, generators, inductors,",
      "and transformers. In ordinary conductors, they cause Joule heating, which creates light in incandescent light bulbs. Time-varying currents emit electromagnetic waves, which are used in telecommunications to broadcast information.\n\n\n\n============================================================\nVoltage\n============================================================\n\nVoltage, also known as (electrical) potential difference, electric pressure, or electric tension, is the difference in electric potential between two points. In a static electric field, it corresponds to the work needed per unit of charge to move a positive test charge from the first point to the second point. In the International System of Units (SI), the derived unit for voltage is the volt (V).\nThe voltage between points can be caused by the build-up of electric charge (e.g., a capacitor), and from an electromotive force (e.g., electromagnetic induction in a generator). On a macroscopic scale, a potential difference can be caused by electrochemical processes (e.g., cells and batteries), the pressure-induced piezoelectric effect, photovoltaic effect, and the thermoelectric effect. Since it is the difference in electric potential, it is a physical scalar quantity.\nA voltmeter can be used to measure the voltage between two points in a system. Often a common reference potential such as the ground of the system is used as one of the points. In this case, voltage is often mentioned at a point without completely mentioning the other measurement point. A voltage can be associated with either a source of energy or the loss, dissipation, or storage of energy.\n\n============================================================\nElectrical resistance and conductance\n============================================================\n\nThe electrical resistance of an object is a measure of its opposition to the flow of electric current. Its reciprocal quantity is electrical conductance, measuring the ease with which an electric current passes. Electrical resistance shares some conceptual parallels with mechanical friction. The SI unit of electrical resistance is the ohm (Ω), while electrical conductance is measured in siemens (S) (formerly called the 'mho' and then represented by ℧).\nThe resistance of an object depends in large part on the material it is made of. Objects made of electrical insulators like rubber tend to have very high resistance and low conductance, while objects made of electrical conductors like metals tend to have very low resistance and high conductance. This relationship is quantified by resistivity or conductivity. The nature of a material is not the only factor in resistance and conductance, however; it also depends on the size and shape of an object because these properties are extensive rather than intensive. For example, a wire's resistance is higher if it is long and thin, and lower if it is short and thick. All objects resist electrical current, except for superconductors, which have a",
      "resistance of zero.\nThe resistance R of an object is defined as the ratio of voltage V across it to current I through it, while the conductance G is the reciprocal:\n\n  \n    \n      \n        R\n        =\n        \n          \n            V\n            I\n          \n        \n        ,\n        \n        G\n        =\n        \n          \n            I\n            V\n          \n        \n        =\n        \n          \n            1\n            R\n          \n        \n        .\n      \n    \n    {\\displaystyle R={\\frac {V}{I}},\\qquad G={\\frac {I}{V}}={\\frac {1}{R}}.}\n  \n\nFor a wide variety of materials and conditions, V and I  are directly proportional to each other, and therefore R and G are constants (although they will depend on the size and shape of the object, the material it is made of, and other factors like temperature or strain). This proportionality is called Ohm's law, and materials that satisfy it are called ohmic materials.\nIn other cases, such as a transformer, diode, incandescent light bulb or battery, V and I are not directly proportional. The ratio ⁠V/I⁠ is sometimes still useful, and is referred to as a chordal resistance or static resistance, since it corresponds to the inverse slope of a chord between the origin and an I–V curve. In other situations, the derivative \n  \n    \n      \n        \n          \n            \n              \n                d\n              \n              V\n            \n            \n              \n                d\n              \n              I\n            \n          \n        \n      \n    \n    {\\textstyle {\\frac {\\mathrm {d} V}{\\mathrm {d} I}}}\n  \n may be most useful; this is called the differential resistance.\n\n\n\n============================================================\nSeries and parallel circuits\n============================================================\n\nTwo-terminal components and electrical networks can be connected in series or parallel. The resulting electrical network will have two terminals, and itself can participate in a series or parallel topology. Whether a two-terminal \"object\" is an electrical component (e.g. a resistor) or an electrical network (e.g. resistors in series) is a matter of perspective. This article will use \"component\" to refer to a two-terminal \"object\" that participates in the series/parallel networks.\nComponents connected in series are connected along a single \"electrical path\", and each component has the same electric current through it, equal to the current through the network. The voltage across the network is equal to the sum of the voltages across each component.\nComponents connected in parallel are connected along multiple paths, and each component has the same voltage across it, equal to the voltage across the network. The current through the network is equal to the sum of the currents through each component.\nThe two preceding statements are equivalent, except for exchanging the role of voltage and current.\nA circuit composed solely of components connected in series is known as a ser",
      "ies circuit; likewise, one connected completely in parallel is known as a parallel circuit. Many circuits can be analyzed as a combination of series and parallel circuits, along with other configurations.\nIn a series circuit, the current that flows through each of the components is the same, and the voltage across the circuit is the sum of the individual voltage drops across each component. In a parallel circuit, the voltage across each of the components is the same, and the total current is the sum of the currents flowing through each component.\nConsider a very simple circuit consisting of four light bulbs and a 12-volt electric battery. If a wire joins the battery to one bulb, to the next bulb, to the next bulb, to the next bulb, then back to the battery in one continuous loop, the bulbs are said to be in series. If each bulb is wired to the battery in a separate loop, the bulbs are said to be in parallel. If the four light bulbs are connected in series, the same current flows through all of them and the voltage drop is 3 volts across each bulb, which may not be sufficient to make them glow.  If the light bulbs are connected in parallel, the currents through the light bulbs combine to form the current in the battery, while the voltage drop is 12 volts across each bulb and they all glow.\nIn a series circuit, every device must function for the circuit to be complete. If one bulb burns out in a series circuit, the entire circuit is broken. In parallel circuits, each light bulb has its own circuit, so all but one light could be burned out, and the last one will still function.\n\n\n\n============================================================\nElectromagnetism\n============================================================\n\nIn physics, electromagnetism is an interaction that occurs between particles with electric charge via electromagnetic fields. The electromagnetic force is one of the four fundamental forces of nature. It is the dominant force in the interactions of atoms and molecules. Electromagnetism can be thought of as a combination of electrostatics and magnetism, which are distinct but closely intertwined phenomena. Electromagnetic forces occur between any two charged particles. Electric forces cause an attraction between particles with opposite charges and repulsion between particles with the same charge, while magnetism is an interaction that occurs between charged particles in relative motion. These two forces are described in terms of electromagnetic fields. Macroscopic charged objects are described in terms of Coulomb's law for electricity and Ampère's force law for magnetism; the Lorentz force describes microscopic charged particles.\nThe electromagnetic force is responsible for many of the chemical and physical phenomena observed in daily life. The electrostatic attraction between atomic nuclei and their electrons holds atoms together. Electric forces also allow different atoms to combine into molecules, including the macromolecules such as",
      "proteins that form the basis of life. Meanwhile, magnetic interactions between the spin and angular momentum magnetic moments of electrons also play a role in chemical reactivity; such relationships are studied in spin chemistry. Electromagnetism also plays several crucial roles in modern technology: electrical energy production, transformation and distribution; light, heat, and sound production and detection; fiber optic and wireless communication; sensors; computation; electrolysis; electroplating; and mechanical motors and actuators.\nElectromagnetism has been studied since ancient times. Many ancient civilizations, including the Greeks and the Mayans, created wide-ranging theories to explain lightning, static electricity, and the attraction between magnetized pieces of iron ore. However, it was not until the late 18th century that scientists began to develop a mathematical basis for understanding the nature of electromagnetic interactions. In the 18th and 19th centuries, prominent scientists and mathematicians such as Coulomb, Gauss and Faraday developed namesake laws which helped to explain the formation and interaction of electromagnetic fields. This process culminated in the 1860s with the discovery of Maxwell's equations, a set of four partial differential equations which provide a complete description of classical electromagnetic fields. Maxwell's equations provided a sound mathematical basis for the relationships between electricity and magnetism that scientists had been exploring for centuries, and predicted the existence of self-sustaining electromagnetic waves. Maxwell postulated that such waves make up visible light, which was later shown to be true. Gamma-rays, x-rays, ultraviolet, visible, infrared radiation, microwaves and radio waves were all determined to be electromagnetic radiation differing only in their range of frequencies.\nIn the modern era, scientists continue to refine the theory of electromagnetism to account for the effects of modern physics, including quantum mechanics and relativity. The theoretical implications of electromagnetism, particularly the requirement that observations remain consistent when viewed from various moving frames of reference (relativistic electromagnetism) and the establishment of the speed of light based on properties of the medium of propagation (permeability and permittivity), helped inspire Einstein's theory of special relativity in 1905. Quantum electrodynamics (QED) modifies Maxwell's equations to be consistent with the quantized nature of matter. In QED, changes in the electromagnetic field are expressed in terms of discrete excitations, particles known as photons, the quanta of light.\n\n\n\n============================================================\nElectromagnetic induction\n============================================================\n\nElectromagnetic induction or magnetic induction is the production of an electromotive force (emf) across an electrical conductor in a changing magnetic fi",
      "eld.\nMichael Faraday is generally credited with the discovery of induction in 1831, and James Clerk Maxwell mathematically described it as Faraday's law of induction. Lenz's law describes the direction of the induced field. Faraday's law was later generalized to become the Maxwell–Faraday equation, one of the four Maxwell equations in his theory of electromagnetism.\nElectromagnetic induction has found many applications, including electrical components such as inductors and transformers, and devices such as electric motors and generators.\n\n============================================================\nElectric battery\n============================================================\n\nAn electric battery is a source of electric power consisting of one or more electrochemical cells with external connections for powering electrical devices. When a battery is supplying power, its positive terminal is the cathode and its negative terminal is the anode. The terminal marked negative is the source of electrons. When a battery is connected to an external electric load, those negatively charged electrons flow through the circuit and reach  the positive terminal, thus causing a redox reaction by attracting positively charged ions, or cations. Thus, higher energy reactants are converted to lower energy products, and the free-energy difference is delivered to the external circuit as electrical energy. Historically the term \"battery\" specifically referred to a device composed of multiple cells; however, the usage has evolved to include devices composed of a single cell.\nPrimary (single-use or \"disposable\") batteries are used once and discarded, as the electrode materials are irreversibly changed during discharge; a common example is the alkaline battery used for flashlights and a multitude of portable electronic devices. Secondary (rechargeable) batteries can be discharged and recharged multiple times using an applied electric current; the original composition of the electrodes can be restored by reverse current. Examples include the lead–acid  automotive battery  used in internal combustion engine vehicles,  and lithium-ion batteries used for portable electronics  and electric cars. \nBatteries come in many shapes and sizes, from miniature cells used to power hearing aids and wristwatches to, at the largest extreme, huge battery banks the size of rooms that provide standby or emergency power for telephone exchanges and computer data centers. Batteries have much lower specific energy (energy per unit mass) than common fuels such as gasoline. In automobiles, this is somewhat offset by the higher efficiency of electric motors in converting electrical energy to mechanical work, compared to combustion engines.\n\n\n\n============================================================\nElectrical safety\n============================================================\n\nIn electrical engineering, electrical safety testing is essential to make sure electrical products and installations are sa",
      "fe. To meet this goal, governments and various technical bodies have developed electrical safety standards. All countries have their own electrical safety standards that must be complied with. To meet to these standards, electrical products and installations must pass electrical safety tests.\nSome types of electrical safety tests include: \n\ndielectric withstand test (also called a hipot test)\ninsulation resistance test (IR test)\nearth continuity test\nleakage current test\nElectrical safety tests are described in various national and international standards.\n\n============================================================\nElectric power\n============================================================\n\nElectric power is the rate of transfer of electrical energy within a circuit. Its SI unit is the watt, the general unit of power, defined as one joule per second. Standard prefixes apply to watts as with other SI units: thousands, millions and billions of watts are called kilowatts, megawatts and gigawatts respectively.\nIn common parlance, electric power is the production and delivery of electrical energy, an essential public utility in much of the world. Electric power is usually produced by electric generators, but can also be supplied by sources such as electric batteries. It is usually supplied to businesses and homes (as domestic mains electricity) by the electric power industry through an electrical grid.\nElectric power can be delivered over long distances by transmission lines and used for applications such as motion, light or heat with high efficiency."
    ]
  },
  {
    "id": "ebook-beece",
    "title": "Basic Electrical Electronics and Computer Engineering",
    "author": "R.K. Rajput",
    "category": "Electrical Engineering",
    "cover": "💻",
    "isEbook": true,
    "ratings": [],
    "pages": [
      "💻  BASIC ELECTRICAL ELECTRONICS AND COMPUTER ENGINEERING\n════════════════════════════════════════════════════════════\nAuthor   : R.K. Rajput\nCategory : Electrical Engineering\nSource   : Wikipedia (CC BY-SA 4.0)\nTopics   : Digital electronics, Logic gate, Boolean algebra, Number system, Computer architecture, Flip-flop (electronics), Multiplexer, Analog-to-digital converter, Modulation, Integrated circuit, Computer programming\n\nThis e-book contains real encyclopedic content on the core\ntopics of \"Basic Electrical Electronics and Computer Engineering\", compiled from Wikipedia.\nNavigate using the arrows below to read each chapter.",
      "============================================================\nDigital electronics\n============================================================\n\nDigital electronics is a field of electronics involving the study of digital signals and the engineering of devices that use or produce them. It deals with the relationship between binary inputs and outputs by passing electrical signals through logical gates, resistors, capacitors, amplifiers, and other electronic components. The field of digital electronics is in contrast to analog electronics, which work primarily with analog signals (signals with varying degrees of intensity as opposed to on/off two-state binary signals). Despite the name, digital electronics designs include important analog design considerations.\nLarge assemblies of logic gates, used to represent more complex ideas, are often packaged into integrated circuits. Complex devices may have simple electronic representations of Boolean logic functions.\n\n============================================================\nLogic gate\n============================================================\n\nA logic gate is a device that performs a Boolean function, a logical operation performed on one or more binary inputs that produces a single binary output. Depending on the context, the term may refer to an ideal logic gate, one that has, for instance, zero rise time and unlimited fan-out, or it may refer to a non-ideal physical device (see ideal and real op-amps for comparison).\nThe primary way of building logic gates uses diodes or transistors acting as electronic switches. Today, most logic gates are made from MOSFETs (metal–oxide–semiconductor field-effect transistors). They can also be constructed using vacuum tubes, electromagnetic relays with relay logic, fluidic logic, pneumatic logic, optics, molecules, acoustics, or even mechanical or thermal elements.\nLogic gates can be cascaded in the same way that Boolean functions can be composed, allowing the construction of a physical model of all of Boolean logic, and therefore, all of the algorithms and mathematics that can be described with Boolean logic. Logic circuits include such devices as multiplexers, registers, arithmetic logic units (ALUs), and computer memory, all the way up through complete microprocessors, which may contain more than 100 million logic gates.\nCompound logic gates AND-OR-invert (AOI) and OR-AND-invert (OAI) are often employed in circuit design because their construction using MOSFETs is simpler and more efficient than the sum of the individual gates.\nThere are seven basic logic gates: NOT, OR, NOR (Negation of the OR statement), AND, NAND (Negation of the AND statement), XOR (Exclusive OR), XNOR (Negation of the Exclusive OR statement).\n\n\n\n============================================================\nBoolean algebra\n============================================================\n\nIn mathematics and mathematical logic, Boolean algebra is a branch of algebra. It differs from elementary alge",
      "bra in two ways. First, the values of the variables are the truth values true and false, usually denoted by 1 and 0, whereas in elementary algebra the values of the variables are numbers. Second, Boolean algebra uses logical operators such as conjunction (and) denoted as ∧, disjunction (or) denoted as ∨, and negation (not) denoted as ¬. Elementary algebra, on the other hand, uses arithmetic operators such as addition, multiplication, subtraction, and division. Boolean algebra is therefore a formal way of describing logical operations in the same way that elementary algebra describes numerical operations.\nBoolean algebra was introduced by George Boole in his first book The Mathematical Analysis of Logic (1847), and set forth more fully in his An Investigation of the Laws of Thought (1854). According to Huntington, the term Boolean algebra was first suggested by Henry M. Sheffer in 1913, although Charles Sanders Peirce gave the title \"A Boolian [sic] Algebra with One Constant\" to the first chapter of his \"The Simplest Mathematics\" in 1880. Boolean algebra has been fundamental in the development of digital electronics, and is provided for in all modern programming languages. It is also used in set theory and statistics.\n\n============================================================\nNumber system\n============================================================\n\nA number is a mathematical object used to count, measure, and label. The most basic examples are the natural numbers: 1, 2, 3, 4, 5, and so forth. Individual numbers can be represented in language with number words or by dedicated symbols called numerals; for example, \"five\" is a number word and \"5\" is the corresponding numeral. As only a limited list of symbols can be memorized, a numeral system is used to represent any number in an organized way. The most common representation is the Hindu–Arabic numeral system, which can display any non-negative integer using a combination of ten symbols, called numerical digits. Numerals can be used for counting (as with cardinal number of a collection or set), labels (as with telephone numbers), for ordering (as with serial numbers), and for codes (as with ISBNs). In common usage, a numeral is not clearly distinguished from the number that it represents.\nIn mathematics, the notion of number has been extended over the centuries to include zero (0), negative numbers, rational numbers such as one half \n  \n    \n      \n        \n          (\n          \n            \n              \n                1\n                2\n              \n            \n          \n          )\n        \n      \n    \n    {\\displaystyle \\left({\\tfrac {1}{2}}\\right)}\n  \n, real numbers such as the square root of 2 \n  \n    \n      \n        \n          (\n          \n            \n              2\n            \n          \n          )\n        \n      \n    \n    {\\displaystyle \\left({\\sqrt {2}}\\right)}\n  \n, and π, and complex numbers which extend the real numbers with a square root of −1, and its combinations with",
      "real numbers by adding or subtracting its multiples. Calculations with numbers are done with arithmetical operations, the most familiar being addition, subtraction, multiplication, division, and exponentiation. Their study or usage is called arithmetic, a term which may also refer to number theory, the study of the properties of numbers.\nViewing the concept of zero as a number required a fundamental shift in philosophy, identifying nothingness with a value. During the 19th century, mathematicians began to develop the various systems now called algebraic structures, which share certain properties of numbers, and may be seen as extending the concept. Some algebraic structures are explicitly referred to as numbers (such as the p-adic numbers and hypercomplex numbers) while others are not, but this is more a matter of convention than a mathematical distinction.\n\n============================================================\nComputer architecture\n============================================================\n\nIn computer science and computer engineering, a computer architecture is the structure of a computer system made from component parts. It can sometimes be a high-level description that ignores details of the implementation. At a more detailed level, the description may include the instruction set architecture design, microarchitecture design, logic design, and implementation.\n\n\n\n============================================================\nFlip-flop (electronics)\n============================================================\n\nIn electronics, flip-flops and latches are circuits that have two stable states that can store state information – a bistable multivibrator. The circuit can be made to change state by signals applied to one or more control inputs and will output its state (often along with its logical complement). It is the basic storage element in sequential logic. Flip-flops and latches are fundamental building blocks of digital electronics systems used in computers, communications, and many other types of systems.\nFlip-flops and latches are used as data storage elements to store a single bit (binary digit) of data; one of its two states represents a \"one\" and the other represents a \"zero\". Such data storage can be used for storage of state, and such a circuit is described as sequential logic in electronics. When used in a finite-state machine, the output and next state depend not only on its current input, but also on its current state (and hence, previous inputs). It can also be used for counting of pulses, and for synchronizing variably-timed input signals to some reference timing signal.\nThe term flip-flop has historically referred generically to both level-triggered (asynchronous, transparent, or opaque) and edge-triggered (synchronous, or clocked) circuits that store a single bit of data using gates. Modern authors reserve the term flip-flop exclusively for edge-triggered storage elements and latches for level-triggered ones. The terms \"ed",
      "ge-triggered\", and \"level-triggered\" may be used to avoid ambiguity.\nWhen a level-triggered latch is enabled, it becomes transparent, but an edge-triggered flip-flop's output only changes on a clock edge (either positive going or negative going).\nDifferent types of flip-flops and latches are available as integrated circuits, usually with multiple elements per chip. For example, 74HC75 is a quadruple transparent latch in the 7400 series.\n\n============================================================\nMultiplexer\n============================================================\n\nIn electronics, a multiplexer (or mux; spelled sometimes as multiplexor), also known as a data selector, is a device that selects between several analog or digital input signals and forwards the selected input to a single output line. The selection is directed by a separate set of digital inputs known as select lines. A multiplexer of \n  \n    \n      \n        \n          2\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle 2^{n}}\n  \n inputs has \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n select lines, which are used to select which input line to send to the output.\nA multiplexer makes it possible for several input signals to share one device or resource, for example, one analog-to-digital converter or one communications transmission medium, instead of having one device per input signal. Multiplexers can also be used to implement Boolean functions of multiple variables.\nConversely, a demultiplexer (or demux) is a device that takes a single input signal and selectively forwards it to one of several output lines. A multiplexer is often used with a complementary demultiplexer on the receiving end.\nAn electronic multiplexer can be considered as a multiple-input, single-output switch, and a demultiplexer as a single-input, multiple-output switch. The schematic symbol for a multiplexer is an isosceles trapezoid with the longer parallel side containing the input pins and the short parallel side containing the output pin.  The schematic on the right shows a 2-to-1 multiplexer on the left and an equivalent switch on the right. The \n  \n    \n      \n        s\n        e\n        l\n      \n    \n    {\\displaystyle sel}\n  \n wire connects the desired input to the output.\n\n============================================================\nAnalog-to-digital converter\n============================================================\n\nIn electronics, an analog-to-digital converter (ADC, A/D, or A-to-D) is a system that converts an analog signal, such as from fingers touching a touchscreen, sound entering a microphone, or light entering a digital camera, into a digital signal.\nAn ADC may also provide an isolated measurement, such as an electronic device that converts an analog input voltage or current to a digital number representing the magnitude of the voltage or current. Typically, the digital output is a two's complement binary number that is proportional to the input,",
      "but there are other possibilities.\nThere are several ADC architectures. Due to the complexity and the need for precisely matched components, all but the most specialized ADCs are implemented as integrated circuits (ICs). These typically take the form of metal–oxide–semiconductor (MOS) mixed-signal integrated circuit chips that integrate both analog and digital circuits.\nA digital-to-analog converter (DAC) performs the reverse function; it converts a digital signal into an analog signal.\n\n============================================================\nModulation\n============================================================\n\nSignal modulation is the process of varying one or more properties of a periodic waveform in electronics and telecommunication for the purpose of transmitting information.\nThe process encodes information in the form of a message signal modulated onto a carrier signal to be transmitted. For example, the message signal might be an audio signal representing sound from a microphone, a video signal representing moving images from a video camera, or a digital signal representing a sequence of binary digits, a bitstream from a computer. \nCarrier waves are necessary when the frequency of the message is too low to practically transmit. Generally, receiving a radio wave requires a radio antenna with a length that is one-fourth of the wavelength of the transmitted wave.  For low-frequency radio waves, wavelength is on the scale of kilometers and building such a large antenna is not practical.\nAnother purpose of modulation is to transmit multiple channels of information through a single communication medium, using frequency-division multiplexing (FDM). For example, in cable television (which uses FDM), many carrier signals, each modulated with a different television channel, are transported through a single cable to customers. Since each carrier occupies a different frequency, the channels do not interfere with each other. At the destination end, the carrier signal is demodulated to extract the information-bearing modulation signal.\nA modulator is a device or circuit that performs modulation. A demodulator (sometimes detector) is a circuit that performs demodulation, the inverse of modulation. A modem (from modulator–demodulator), used in bidirectional communication, can perform both operations. The lower frequency band occupied by the modulation signal is called the baseband, while the higher frequency band occupied by the modulated carrier is called the passband.\nSignal modulation techniques are fundamental methods used in wireless communication to encode information onto a carrier wave by varying its amplitude, frequency, or phase. Key techniques and their typical applications  \nTypes of Signal Modulation\n\nAmplitude Shift Keying (ASK): Varies the amplitude of the carrier signal to represent data. Simple and energy efficient, but vulnerable to noise. Used in RFID and sensor networks.\nFrequency Shift Keying (FSK): Changes the frequency of the",
      "carrier signal to encode information. Resistant to noise, simple in implementation, often used in telemetry and paging systems.\nPhase Shift Keying (PSK): Modifies the phase of the carrier signal based on data. Common forms include Binary PSK (BPSK) and Quadrature PSK (QPSK), used in Wi-Fi, Bluetooth, and cellular networks. Offers good spectral efficiency and robustness against interference.\nQuadrature Amplitude Modulation (QAM): Simultaneously varies both amplitude and phase to transmit multiple bits per symbol, increasing data rates. Used extensively in Wi-Fi, cable television, and LTE systems.\nOrthogonal Frequency Division Multiplexing (OFDM): Splits the data across multiple, closely spaced sub-carriers, each modulated separately (often with QAM or PSK). Provides high spectral efficiency and robustness in multipath environments and is widely used in WLAN, LTE, and WiMAX.\nOther advanced techniques:\n\nAmplitude Phase Shift Keying (APSK): Combines features of PSK and QAM, mainly used in satellite communications for improved power efficiency.\nSpread Spectrum (e.g., DSSS): Spreads the signal energy across a wide band for robust, low probability of intercept transmission.\nIn analog modulation, an analog modulation signal is \"impressed\" on the carrier. Examples are amplitude modulation (AM) in which the amplitude (strength) of the carrier wave is varied by the modulation signal, and frequency modulation (FM) in which the frequency of the carrier wave is varied by the modulation signal. These were the earliest types of modulation, and are used to transmit an audio signal representing sound in AM and FM radio broadcasting. More recent systems use digital modulation, which impresses a digital signal consisting of a sequence of binary digits (bits), a bitstream, on the carrier, by means of mapping bits to elements from a discrete alphabet to be transmitted. This alphabet can consist of a set of real or complex numbers, or sequences, like oscillations of different frequencies, so-called frequency-shift keying (FSK) modulation. A more complicated digital modulation method that employs multiple carriers, orthogonal frequency-division multiplexing (OFDM), is used in WiFi networks, digital radio stations and digital cable television transmission.\n\n\n\n============================================================\nIntegrated circuit\n============================================================\n\nAn integrated circuit (IC), also known as a microchip or simply chip, is a compact assembly of electronic circuits formed from various electronic components — such as transistors, resistors, and capacitors — and their interconnections. These components are fabricated onto a thin, flat piece (\"chip\") of semiconductor material, most commonly silicon. Integrated circuits are integral to a wide variety of electronic devices — including computers, smartphones, and televisions — performing functions such as data processing, control, and storage. They have transformed the field of e",
      "lectronics by enabling device miniaturization, improving performance, and reducing cost.\nCompared to assemblies built from discrete components, integrated circuits are orders of magnitude smaller, faster, more energy-efficient, and less expensive, allowing for a very high transistor count. Its capability for mass production, its high reliability, and the standardized, modular approach of integrated circuit design facilitated rapid replacement of designs using discrete transistors. Today, ICs are present in virtually all electronic devices and have revolutionized modern technology. Products such as computer processors, microcontrollers, digital signal processors, and embedded processing chips in home appliances are foundational to contemporary society due to their small size, low cost, and versatility.\nVery-large-scale integration was made practical by technological advancements in semiconductor device fabrication. Since their origins in the 1960s, the size, speed, and capacity of chips have progressed enormously, driven by technical advances that fit more and more transistors on chips of the same size – a modern chip may have many billions of transistors in an area the size of a human fingernail. These advances, roughly following Moore's law, make the computer chips of today possess millions of times the capacity and thousands of times the speed of the computer chips of the early 1970s.\nICs have three main advantages over circuits constructed out of discrete components: size, cost and performance. The size and cost is low because the chips, with all their components, are printed as a unit by photolithography rather than being constructed one transistor at a time. Furthermore, packaged ICs use much less material than discrete circuits. Performance is high because the IC's components switch quickly and consume comparatively little power because of their small size and proximity. The main disadvantage of ICs is the high initial cost of designing them and the enormous capital cost of factory construction. This high initial cost means ICs are only commercially viable when high production volumes are anticipated.\n\n\n\n============================================================\nComputer programming\n============================================================\n\nComputer programming or coding is the composition of sequences of instructions, called programs, that computers can follow to perform tasks. It involves designing and implementing algorithms, step-by-step specifications of procedures, by writing code in one or more programming languages. Programmers typically use high-level programming languages that are more easily intelligible to humans than machine code, which is directly executed by the central processing unit. Proficient programming usually requires expertise in several different subjects, including knowledge of the application domain, details of programming languages and generic code libraries, specialized algorithms, and formal logic.\nAuxilia",
      "ry tasks accompanying and related to programming include analyzing requirements, testing, debugging (investigating and fixing problems), implementation of build systems, and management of derived artifacts, such as programs' machine code. While these are sometimes considered programming, often the term software development is used for this larger overall process – with the terms programming, implementation, and coding reserved for the writing and editing of code per se. Sometimes software development is known as software engineering, especially when it employs formal methods or follows an engineering design process."
    ]
  },
  {
    "id": "ebook-circuit-theory",
    "title": "Circuit Theory",
    "author": "A. Chakrabarti",
    "category": "Electrical Engineering",
    "cover": "🔁",
    "isEbook": true,
    "ratings": [],
    "pages": [
      "🔁  CIRCUIT THEORY\n════════════════════════════════════════════════════════════\nAuthor   : A. Chakrabarti\nCategory : Electrical Engineering\nSource   : Wikipedia (CC BY-SA 4.0)\nTopics   : Network analysis (electrical circuits), Thévenin's theorem, Norton's theorem, Superposition theorem, RLC circuit, Resonance, Electrical impedance, Laplace transform, Two-port network, Mesh analysis, Nodal analysis\n\nThis e-book contains real encyclopedic content on the core\ntopics of \"Circuit Theory\", compiled from Wikipedia.\nNavigate using the arrows below to read each chapter.",
      "============================================================\nNetwork analysis (electrical circuits)\n============================================================\n\nIn electrical engineering and electronics, a network is a collection of interconnected components. Network analysis is the process of finding the voltages across, and the currents through, all network components.  There are many techniques for calculating these values; however, for the most part, the techniques assume linear components. Except where stated, the methods described in this article are applicable only to linear network analysis.\n\n============================================================\nThévenin's theorem\n============================================================\n\nAs originally stated in terms of direct-current resistive circuits only, Thévenin's theorem states that \"Any linear electrical network containing only voltage sources, current sources and resistances can be replaced at terminals A–B by an equivalent combination of a voltage source Vth in a series connection with a resistance Rth.\"\n\nThe equivalent voltage Vth is the voltage obtained at terminals A–B of the network with terminals A–B open circuited.\nThe equivalent resistance Rth is the resistance that the circuit between terminals A and B would have if all ideal voltage sources in the circuit were replaced by a short circuit and all ideal current sources were replaced by an open circuit (i.e., the sources are set to provide zero voltages and currents).\nIf terminals A and B are connected to one another (short), then the current flowing from A and B will be \n  \n    \n      \n        \n          \n            \n              V\n              \n                \n                  t\n                  h\n                \n              \n            \n            \n              R\n              \n                \n                  t\n                  h\n                \n              \n            \n          \n        \n      \n    \n    {\\textstyle {\\frac {V_{\\mathrm {th} }}{R_{\\mathrm {th} }}}}\n  \n according to the Thévenin equivalent circuit. This means that Rth could alternatively be calculated as Vth divided by the short-circuit current between A and B when they are connected together.\nIn circuit theory terms, the theorem allows any one-port network to be reduced to a single voltage source and a single impedance.\nThe theorem also applies to frequency domain AC circuits consisting of reactive (inductive and capacitive) and resistive impedances. It means the theorem applies for AC in an exactly same way to DC except that resistances are generalized to impedances.\nThe theorem was independently derived in 1853 by the German scientist Hermann von Helmholtz and in 1883 by Léon Charles Thévenin (1857–1926), an electrical engineer with France's national Postes et Télégraphes telecommunications organization.\nThévenin's theorem and its dual, Norton's theorem, are widely used to make circuit analysis simpler and to study a circuit's initial-co",
      "ndition and steady-state response. Thévenin's theorem can be used to convert any circuit's sources and impedances to a Thévenin equivalent; use of the theorem may in some cases be more convenient than use of Kirchhoff's circuit laws.\n\n============================================================\nNorton's theorem\n============================================================\n\nIn direct-current circuit theory, Norton's theorem, also called the Mayer–Norton theorem, is a simplification that can be applied to networks made of linear time-invariant resistances, voltage sources, and current sources. At a pair of terminals of the network, it can be replaced by a current source and a single resistor in parallel. \nFor alternating current (AC) systems the theorem can be applied to reactive impedances as well as resistances. The Norton equivalent circuit is used to represent any network of linear sources and impedances at a given frequency.\nNorton's theorem and its dual, Thévenin's theorem, are widely used for circuit analysis simplification and to study circuit's initial-condition and steady-state response.\nNorton's theorem was independently derived in 1926 by Siemens & Halske researcher Hans Ferdinand Mayer (1895–1980) and Bell Labs engineer Edward Lawry Norton (1898–1983).\nTo find the Norton equivalent of a linear time-invariant circuit, the Norton current ⁠\n  \n    \n      \n        \n          I\n          \n            \n              n\n              o\n            \n          \n        \n      \n    \n    {\\displaystyle I_{\\mathrm {no} }}\n  \n⁠ is calculated as the current flowing at the two terminals ⁠\n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n⁠ and ⁠\n  \n    \n      \n        B\n      \n    \n    {\\displaystyle B}\n  \n⁠ of the original circuit that is now short (zero impedance between the terminals). The Norton resistance ⁠\n  \n    \n      \n        \n          R\n          \n            \n              n\n              o\n            \n          \n        \n      \n    \n    {\\displaystyle R_{\\mathrm {no} }}\n  \n⁠ is found by calculating the output voltage ⁠\n  \n    \n      \n        \n          V\n          \n            \n              o\n            \n          \n        \n      \n    \n    {\\displaystyle V_{\\mathrm {o} }}\n  \n⁠ produced at ⁠\n  \n    \n      \n        A\n      \n    \n    {\\displaystyle A}\n  \n⁠ and ⁠\n  \n    \n      \n        B\n      \n    \n    {\\displaystyle B}\n  \n⁠ with no resistance or load connected to, then ⁠\n  \n    \n      \n        \n          \n            R\n            \n              \n                n\n                o\n              \n            \n          \n          =\n          \n            \n              \n                V\n                \n                  \n                    o\n                  \n                \n              \n              \n                I\n                \n                  \n                    n\n                    o\n                  \n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle \\textsty",
      "le R_{\\mathrm {no} }={V_{\\mathrm {o} } \\over I_{\\mathrm {no} }}}\n  \n⁠; equivalently, this is the resistance between the terminals with all (independent) voltage sources short-circuited and independent current sources open-circuited (i.e., each independent source is set to produce zero energy). This is equivalent to calculating the Thevenin resistance.\nWhen there are dependent sources, the more general method must be used. The voltage at the terminals is calculated for an injection of a 1 ampere test current at the terminals. This voltage divided by the 1 A current is the Norton impedance ⁠\n  \n    \n      \n        \n          R\n          \n            \n              n\n              o\n            \n          \n        \n      \n    \n    {\\displaystyle R_{\\mathrm {no} }}\n  \n⁠ (in ohms). This method must be used if the circuit contains dependent sources, but it can be used in all cases even when there are no dependent sources.\n\n============================================================\nSuperposition theorem\n============================================================\n\nThe superposition principle, also known as superposition property, states that, for all linear systems, the net response caused by two or more stimuli is the sum of the responses that would have been caused by each stimulus individually. So that if input A produces response X, and input B produces response Y, then input (A + B) produces response (X + Y).\nA function \n  \n    \n      \n        F\n        (\n        x\n        )\n      \n    \n    {\\displaystyle F(x)}\n  \n that satisfies the superposition principle is called a linear function. Superposition can be defined by two simpler properties: additivity  \n\n  \n    \n      \n        F\n        (\n        \n          x\n          \n            1\n          \n        \n        +\n        \n          x\n          \n            2\n          \n        \n        )\n        =\n        F\n        (\n        \n          x\n          \n            1\n          \n        \n        )\n        +\n        F\n        (\n        \n          x\n          \n            2\n          \n        \n        )\n      \n    \n    {\\displaystyle F(x_{1}+x_{2})=F(x_{1})+F(x_{2})}\n  \n\nand homogeneity\n\n  \n    \n      \n        F\n        (\n        a\n        x\n        )\n        =\n        a\n        F\n        (\n        x\n        )\n      \n    \n    {\\displaystyle F(ax)=aF(x)}\n  \n\nfor scalar a.\nThis principle has many applications in physics and engineering because many physical systems can be modeled as linear systems. For example, a beam can be modeled as a linear system where the input stimulus is the load on the beam and the output response is the deflection of the beam. The importance of linear systems is that they are easier to analyze mathematically; there is a large body of mathematical techniques, frequency-domain linear transform methods such as Fourier and Laplace transforms, and linear operator theory, that are applicable. Because physical systems are generally only approximately linear, the superposition principle",
      "is only an approximation of the true physical behavior.\nThe superposition principle applies to any linear system, including algebraic equations, linear differential equations, and systems of equations of those forms. The stimuli and responses could be numbers, functions, vectors, vector fields, time-varying signals, or any other object that satisfies certain axioms. Note that when vectors or vector fields are involved, a superposition is interpreted as a vector sum. If the superposition holds, then it automatically also holds for all linear operations applied on these functions (due to definition), such as gradients, differentials or integrals (if they exist).\n\n============================================================\nRLC circuit\n============================================================\n\nAn RLC circuit is an electrical circuit consisting of a resistor (R), an inductor (L), and a capacitor (C), connected in series or in parallel. The name of the circuit is derived from the letters that are used to denote the constituent components of this circuit, where the sequence of the components may vary from RLC.\nThe circuit forms a harmonic oscillator for current, and resonates in a manner similar to an LC circuit. Introducing the resistor increases the decay of these oscillations, which is also known as damping. The resistor also reduces the peak resonant frequency. Some resistance is unavoidable even if a resistor is not specifically included as a component.\nRLC circuits have many applications as oscillator circuits. Radio receivers and television sets use them for tuning to select a narrow frequency range from ambient radio waves. In this role, the circuit is often referred to as a tuned circuit. An RLC circuit can be used as a band-pass filter, band-stop filter, low-pass filter or high-pass filter. The tuning application, for instance, is an example of band-pass filtering. The RLC filter is described as a second-order circuit, meaning that any voltage or current in the circuit can be described by a second-order differential equation in circuit analysis.\nThe three circuit elements, R, L and C, can be combined in a number of different topologies. All three elements in series or all three elements in parallel are the simplest in concept and the most straightforward to analyse. There are, however, other arrangements, some with practical importance in real circuits. One issue often encountered is the need to take into account inductor resistance. Inductors are typically constructed from coils of wire, the resistance of which is not usually desirable, but it often has a significant effect on the circuit.\n\n============================================================\nResonance\n============================================================\n\nResonance is a phenomenon that occurs when an object or system is subjected to an external force or vibration whose frequency  matches a resonant frequency (or resonance frequency) of the system, defined as a frequency th",
      "at generates a maximum amplitude response in the system.  When this happens, the object or system absorbs energy from the external force and starts vibrating with a larger amplitude. Resonance can occur in various systems, such as mechanical, electrical, or acoustic systems, and it is often desirable in certain applications, such as musical instruments or radio receivers. However, resonance can also be detrimental, leading to excessive vibrations or even structural failure in some cases. \nAll systems, including molecular systems and particles, tend to vibrate at a natural frequency depending upon their structure; when there is very little damping this frequency is approximately equal to, but slightly above, the resonant frequency. When an oscillating force, an external vibration, is applied at a resonant frequency of a dynamic system, object, or particle, the outside vibration will cause the system to oscillate at a higher amplitude (with more force) than when the same force is applied at other, non-resonant frequencies.\nThe resonant frequencies of a system can be identified when the response to an external vibration creates an amplitude that is a relative maximum within the system. Small periodic forces that are near a resonant frequency of the system have the ability to produce large amplitude oscillations in the system due to the storage of vibrational energy.\nResonance phenomena occur with all types of vibrations or waves: there is mechanical resonance, orbital resonance, acoustic resonance, electromagnetic resonance, nuclear magnetic resonance (NMR), electron spin resonance (ESR) and resonance of quantum wave functions. Resonant systems can be used to generate vibrations of a specific frequency (e.g., musical instruments), or pick out specific frequencies from a complex vibration containing many frequencies (e.g., filters).\nThe term resonance (from Latin resonantia, 'echo', from resonare, 'resound') originated from the field of acoustics discussed by Galileo Galilei in his book Dialogues Concerning Two New Sciences, particularly the sympathetic resonance observed in musical instruments, e.g., when one string starts to vibrate and produce sound after a different one is struck.\n\n\n\n============================================================\nElectrical impedance\n============================================================\n\nIn electrical engineering, impedance is the opposition to alternating current presented by the combined effect of resistance and reactance in a circuit.\nQuantitatively, the impedance of a two-terminal circuit element is the ratio of the complex representation of the sinusoidal voltage between its terminals, to the complex representation of the current flowing through it. In general, it depends upon the frequency of the sinusoidal voltage. \nImpedance extends the concept of resistance to alternating current (AC) circuits, and possesses both magnitude and phase, unlike resistance, which has only magnitude. \nImpedance can be repr",
      "esented as a complex number, with the same units as resistance, for which the SI unit is the ohm (Ω).\nIts symbol is usually Z, and it may be represented by writing its magnitude and phase in the polar form |Z|∠θ. However, Cartesian complex number representation is often more powerful for circuit analysis purposes.\nThe notion of impedance is useful for performing AC analysis of electrical networks, because it allows relating sinusoidal voltages and currents by a simple linear law.  \nIn multiple port networks, the two-terminal definition of impedance is inadequate, but the complex voltages at the ports and the currents flowing through them are still linearly related by the impedance matrix.  \nThe reciprocal of impedance is admittance, whose SI unit is the siemens.\nInstruments used to measure the electrical impedance are called impedance analyzers.\n\n============================================================\nLaplace transform\n============================================================\n\nIn mathematics, the Laplace transform, named after Pierre-Simon Laplace (), is an integral transform that converts a function of a real variable (usually ⁠\n  \n    \n      \n        t\n      \n    \n    {\\displaystyle t}\n  \n⁠, in the time domain) to a function of a complex variable \n  \n    \n      \n        s\n      \n    \n    {\\displaystyle s}\n  \n (in the complex-valued frequency domain, also known as s-domain or s-plane).  The functions are often denoted using a lowercase symbol for the time-domain function and the corresponding uppercase symbol for the frequency-domain function, e.g. \n  \n    \n      \n        x\n        (\n        t\n        )\n      \n    \n    {\\displaystyle x(t)}\n  \n and ⁠\n  \n    \n      \n        X\n        (\n        s\n        )\n      \n    \n    {\\displaystyle X(s)}\n  \n⁠.\nThe transform is useful for converting differentiation and integration in the time domain into the algebraic operations multiplication and division in the Laplace domain (analogous to how logarithms are useful for simplifying multiplication and division into addition and subtraction). This gives the transform many applications in science and engineering, mostly as a tool for solving linear differential equations and dynamical systems by replacing ordinary differential equations and integral equations with algebraic polynomial equations, and by replacing convolution with multiplication.\nFor example, through the Laplace transform, the equation of the simple harmonic oscillator (Hooke's law) \n  \n    \n      \n        \n          x\n          ″\n        \n        (\n        t\n        )\n        +\n        k\n        x\n        (\n        t\n        )\n        =\n        0\n      \n    \n    {\\displaystyle x''(t)+kx(t)=0}\n  \n is converted into the algebraic equation \n  \n    \n      \n        \n          s\n          \n            2\n          \n        \n        X\n        (\n        s\n        )\n        −\n        s\n        x\n        (\n        0\n        )\n        −\n        \n          x\n          ′\n        \n        (\n        0",
      ")\n        +\n        k\n        X\n        (\n        s\n        )\n        =\n        0\n        ,\n      \n    \n    {\\displaystyle s^{2}X(s)-sx(0)-x'(0)+kX(s)=0,}\n  \n which incorporates the initial conditions \n  \n    \n      \n        x\n        (\n        0\n        )\n      \n    \n    {\\displaystyle x(0)}\n  \n and ⁠\n  \n    \n      \n        \n          x\n          ′\n        \n        (\n        0\n        )\n      \n    \n    {\\displaystyle x'(0)}\n  \n⁠, and can be solved for the unknown function \n  \n    \n      \n        X\n        (\n        s\n        )\n        .\n      \n    \n    {\\displaystyle X(s).}\n  \n  Once solved, the inverse Laplace transform can be used to transform it to the original domain. This is often aided by referencing tables such as that given below.\nThe Laplace transform is defined (for suitable functions ⁠\n  \n    \n      \n        f\n      \n    \n    {\\displaystyle f}\n  \n⁠) by the integral\n\n  \n    \n      \n        \n          \n            L\n          \n        \n        {\n        f\n        }\n        (\n        s\n        )\n        =\n        \n          ∫\n          \n            0\n          \n          \n            ∞\n          \n        \n        f\n        (\n        t\n        )\n        \n          e\n          \n            −\n            s\n            t\n          \n        \n        \n        d\n        t\n        ,\n      \n    \n    {\\displaystyle {\\mathcal {L}}\\{f\\}(s)=\\int _{0}^{\\infty }f(t)e^{-st}\\,dt,}\n  \n\nwhere s is a complex number.\nThe Laplace transform is related to many other transforms. It is essentially the same as the Mellin transform and is closely related to the Fourier transform. Unlike for the Fourier transform, the Laplace transform of a function is often an analytic function, meaning that it has a convergent power series, the coefficients of which represent the moments of the original function. Moreover, the techniques of complex analysis, especially contour integrals, can be used for simplifying calculations.\n\n\n\n============================================================\nTwo-port network\n============================================================\n\nIn electronics, a two-port network (a kind of four-terminal network or quadripole) is an electrical network (i.e. a circuit) or device with two pairs of terminals to connect to external circuits. Two terminals constitute a port if the currents applied to them satisfy the essential requirement known as the port condition: the current entering one terminal must equal the current emerging from the other terminal on the same port.  The ports constitute interfaces where the network connects to other networks, the points where signals are applied or outputs are taken.  In a two-port network, often port 1 is considered the input port and port 2 is considered the output port.\nIt is commonly used in mathematical circuit analysis.\n\n\n\n============================================================\nMesh analysis\n============================================================\n\nMesh analysis (or the mesh current method) is a circu",
      "it analysis method for planar circuits; planar circuits are circuits that can be drawn on a plane surface with no wires crossing each other. A more general technique, called loop analysis (with the corresponding network variables called loop currents) can be applied to any circuit, planar or not.\nMesh analysis and loop analysis both make systematic use of Kirchhoff’s voltage law (KVL) to arrive at a set of equations guaranteed to be solvable if the circuit has a solution. Similarly, nodal analysis is a systematic application of Kirchhoff's current law (KCL). Mesh analysis is usually easier to use when the circuit is planar, compared to loop analysis.\n\n============================================================\nNodal analysis\n============================================================\n\nIn electric circuit analysis, nodal analysis (also referred to as node-voltage analysis or the branch current method) is a method of determining the voltage between nodes (points where elements or branches connect) in an electrical circuit in terms of the branch currents.\nNodal analysis is essentially a systematic application of Kirchhoff's current law (KCL) for circuit analysis. Similarly, mesh analysis is a systematic application of Kirchhoff's voltage law (KVL). Nodal analysis writes an equation at each electrical node specifying that the branch currents incident at a node must sum to zero (using KCL). The branch currents are written in terms of the circuit node voltages. As a consequence, each branch constitutive relation must give current as a function of voltage; an admittance representation. For instance, for a resistor, Ibranch = Vbranch * G, where G (=1/R) is the admittance (conductance) of the resistor.\nNodal analysis is possible when all the circuit elements' branch constitutive relations have an admittance representation. Nodal analysis produces a compact set of equations for the network, which can be solved by hand if small, or can be quickly solved using linear algebra by computer. Because of the compact system of equations, many circuit simulation programs (e.g., SPICE) use nodal analysis as a basis. When elements do not have admittance representations, a more general extension of nodal analysis, modified nodal analysis, can be used."
    ]
  }
]